In [1]:
import mysql.connector

In [2]:
conn= mysql.connector.connect(user='sql7721103', password='TD7jb4H7Fd',
                              host='sql7.freesqldatabase.com',
                              database='sql7721103',port = "3306")
conn

In [3]:
cursor = conn.cursor()
cursor

# /* find the number of availalbe copies of the book (Dracula) */
/*******************************************************/

In [23]:

cursor.execute(
""" 
SELECT ( 
(SELECT COUNT(*) as "Num copies of the book (Dracula)" FROM Books
WHERE Title = "Dracula")
-
(SELECT count(*) FROM Loans as L
INNER JOIN Books as b ON L.BookID = b.BookID
WHERE b.Title = "Dracula" AND ReturnedDate IS NULL)
) AS "availalbe copies of the book (Dracula)";

"""
)
cursor.fetchall()

[(2,)]

# /* check total copies of the book */

In [24]:
cursor.execute(
""" 
SELECT COUNT(*) as "Num copies of the book (Dracula)" FROM Books
WHERE Title = "Dracula"

"""
)
cursor.fetchall()

[(3,)]

# /* current total loans of the book */

In [26]:
cursor.execute(
""" 
SELECT COUNT(*) as Total_Loans  FROM Loans as L
INNER JOIN Books as b ON L.BookID = b.BookID
WHERE b.Title = "Dracula"

"""
)
cursor.fetchall()

[(32,)]

# /* total available books of dracula */

In [28]:
cursor.execute(
""" 
SELECT ( 
(SELECT COUNT(*) as "Num copies of the book (Dracula)" FROM Books
WHERE Title = "Dracula")
-
(SELECT count(*) FROM Loans as L
INNER JOIN Books as b ON L.BookID = b.BookID
WHERE b.Title = "Dracula" AND ReturnedDate IS NULL)
) AS "availalbe copies of the book (Dracula)";

"""
)
cursor.fetchall()

[(2,)]


# /* Check books for Due back                             */
# /* generate a report of books due back on July 13, 2020 */
# /* with patron contact information                      */
# /********************************************************/

In [35]:
cursor.execute(
"""
SELECT * FROM Loans AS l
INNER JOIN Patrons AS p ON l.PatronID = p.PatronID
WHERE l.DueDate = "2020-07-13"
"""
)
cursor.fetchall()

[(1996,
  10,
  99,
  '2020-06-29',
  '2020-07-13',
  None,
  'Kala',
  'Simonian',
  'ksimonian2q@landonhotel.com',
  99),
 (1997,
  155,
  47,
  '2020-06-29',
  '2020-07-13',
  None,
  'Lydie',
  'Awmack',
  'lawmack1a@samoca.org',
  47),
 (1998,
  169,
  18,
  '2020-06-29',
  '2020-07-13',
  None,
  'Anthe',
  'Dinjes',
  'adinjesh@samoca.org',
  18),
 (1999,
  73,
  59,
  '2020-06-29',
  '2020-07-13',
  None,
  'Cornelia',
  'Koppe',
  'ckoppe1m@landonhotel.com',
  59)]

# /* Encourage Patrons to check out books                */
# /* generate a report of showing 10 patrons who have
# checked out the fewest  .                          */
# /*******************************************************/

In [42]:
cursor.execute(
"""
SELECT l.PatronID , p.FirstName , p.LastName , p.Email , Count(l.PatronID) as TimesOfVisits FROM Loans as l
INNER JOIN Patrons as p ON l.PatronID = p.PatronID
GROUP BY l.PatronID
order by TimesOfVisits
LIMIT 10

"""
)
cursor.fetchall()

[(83, 'Caril', 'Matejic', 'cmatejic2a@orangevalleycaa.org', 9),
 (69, 'Alaster', 'Ruggles', 'aruggles1w@red30design.com', 9),
 (73, 'Merle', 'Sukbhans', 'msukbhans20@orangevalleycaa.org', 11),
 (94, 'Curr', 'Fittall', 'cfittall2l@orangevalleycaa.org', 12),
 (64, 'Norby', 'Sleight', 'nsleight1r@kinetecoinc.com', 12),
 (50, 'Jack', 'Vaan', 'jvaan@wisdompets.com', 13),
 (7, 'Cammi', 'Kynett', 'ckynett6@orangevalleycaa.org', 14),
 (16, 'Carla', 'Swinfen', 'cswinfenf@kinetecoinc.com', 14),
 (3, 'Aleen', 'Fasey', 'afasey2@kinetecoinc.com', 14),
 (12, 'Orton', 'Stavers', 'ostaversb@orangevalleycaa.org', 14)]

# 
# /* Book Statistics                                      */
# /* create a report to show how many books were 
# published each year.                                    */
# /*******************************************************/

In [4]:
cursor.execute(
"""
SELECT Published, COUNT(DISTINCT(Title)) AS TotalNumberOfPublishedBooks
FROM Books
GROUP BY Published
ORDER BY TotalNumberOfPublishedBooks DESC; 

"""
)
cursor.fetchall()

[(1890, 3),
 (1895, 3),
 (1847, 2),
 (1884, 2),
 (1850, 2),
 (1911, 2),
 (1892, 2),
 (1859, 2),
 (1922, 2),
 (1869, 2),
 (1898, 2),
 (1899, 2),
 (1818, 1),
 (1880, 1),
 (1902, 1),
 (1839, 1),
 (1883, 1),
 (1905, 1),
 (1906, 1),
 (1849, 1),
 (1886, 1),
 (1908, 1),
 (1375, 1),
 (1887, 1),
 (1532, 1),
 (1851, 1),
 (1889, 1),
 (1913, 1),
 (1605, 1),
 (1852, 1),
 (1914, 1),
 (1670, 1),
 (1854, 1),
 (1915, 1),
 (1689, 1),
 (1858, 1),
 (1894, 1),
 (1920, 1),
 (1726, 1),
 (1921, 1),
 (1729, 1),
 (1861, 1),
 (1896, 1),
 (1759, 1),
 (1865, 1),
 (1897, 1),
 (1923, 1),
 (1791, 1),
 (1811, 1),
 (1876, 1),
 (1813, 1),
 (1878, 1),
 (1900, 1),
 (1815, 1),
 (1879, 1),
 (1901, 1)]

# /*************************************************************/
# /* Book Statistics                                           */
# /* create a report to show 5 most popular Books to check out */
# /*************************************************************/

In [8]:
cursor.execute(
"""
SELECT b.Title , COUNT(l.LoanID) AS TotalTimesOfLoans FROM Books as b
INNER JOIN Loans as l ON l.BookID = b.BookID
GROUP BY b.Title 
ORDER BY TotalTimesOfLoans DESC
LIMIT 5;

"""
)
cursor.fetchall()

[('Frankenstein; Or, The Modern Prometheus', 53),
 ('The Awakening, and Selected Short Stories', 43),
 ('The War of the Worlds', 43),
 ('The Scarlet Letter', 42),
 ('The Picture of Dorian Gray', 39)]

# /*******************************************************/
# /* Add new books to the library                        */
# /*******************************************************/

In [16]:

sql = ("INSERT INTO Books"
      "(BookID ,Title , Author , Published , Barcode )" 
      "VALUES (%s , %s , %s , %s , %s)")

val = (203,"to infinity and beyond","Eslam","1996","4356455623415")

cursor.execute(sql, val)
emp_no = cursor.lastrowid

# Make sure data is committed to the database
conn.commit()
print("Inserted")

Inserted

# /*******************************************************/
# /* Check out Books: books(4043822646, 2855934983) whose patron_email(jvaan@wisdompets.com), loandate=2020-08-25, duedate=2020-09-08, loanid=by_your_choice                            */
# /*******************************************************/

In [13]:
cursor.execute(
"""
SELECT BookID FROM Books
WHERE Barcode = 4043822646
"""
)
result_1 = cursor.fetchall()

cursor.execute(
"""
SELECT BookID FROM Books
WHERE Barcode = 2855934983
"""
)
result_2 = cursor.fetchall()

print(result_1[0][0],result_2[0][0])



sql = ("INSERT INTO Loans"
      "(LoanID ,BookID , PatronID , loandate , duedate )" 
      "VALUES (%s , %s , %s , %s , %s)")

val = (20001,result_1[0][0],50,"2020-08-25","2020-09-08")

cursor.execute(sql, val)
emp_no = cursor.lastrowid

# Make sure data is committed to the database
conn.commit()
print("Inserted")

93 11
Inserted

In [14]:


sql = ("INSERT INTO Loans"
      "(LoanID ,BookID , PatronID , loandate , duedate )" 
      "VALUES (%s , %s , %s , %s , %s)")

val = (20002,result_2[0][0],50,"2020-08-25","2020-09-08")

cursor.execute(sql, val)
emp_no = cursor.lastrowid

# Make sure data is committed to the database
conn.commit()
print("Inserted")

Inserted

# /*******************************************************/
# /* Return books to the library (which have barcode=6435968624) and return this book at this date(2020-07-05)                    */
# /*******************************************************/

In [22]:
cursor.execute(
"""
SELECT LoanID as lon_id FROM Loans 
WHERE ReturnedDate Is NULL And BookID = (
SELECT BookID FROM Books
WHERE barcode = 6435968624
)
"""
)
LoanID = cursor.fetchall()

sql = f"UPDATE Loans SET ReturnedDate = '2020-07-05' WHERE LoanID = {LoanID[0][0]}"

cursor.execute(sql)
conn.commit()
print("Updated")

Updated

# /*******************************************************/
# /* Find books to feature for an event                  
 # create a list of books from 1890s that are
 # currently available                                    */
/*******************************************************/

In [29]:
cursor.execute(
"""
CREATE VIEW NumpberOFCopies AS (
SELECT Title  , COUNT(Title) as "Num_copies" FROM Books
GROUP BY Title
);

"""
)
cursor.fetchall()

ProgrammingError: 1050 (42S01): Table 'NumpberOFCopies' already exists

In [31]:
cursor.execute(
"""
CREATE VIEW NumOFNonReturnedC AS (
SELECT b.Title ,Count(b.Title) as CountofNon FROM Books AS b
INNER JOIN Loans AS l ON b.BookID = l.BookID
INNER JOIN NumpberOFCopies AS n on n.Title = b.Title
WHERE (Published between 1890 and 1899)  AND ReturnedDate IS NULL
group by b.Title
);
"""
)
cursor.fetchall()

ProgrammingError: 1050 (42S01): Table 'NumOFNonReturnedC' already exists

In [33]:
cursor.execute(
"""
SELECT distinct(b.Title) as ListOFBooks , b.Author , b.Published FROM Books AS b
INNER JOIN Loans AS l ON b.BookID = l.BookID
INNER JOIN NumpberOFCopies AS n ON n.Title = b.Title
INNER JOIN NumOFNonReturnedC AS non ON non.Title = b.Title
WHERE (Published between 1890 and 1899) and n.Num_copies > non.CountofNon 
"""
)

cursor.fetchall()

[('The Picture of Dorian Gray', 'Oscar Wilde', 1890),
 ('The Importance of Being Earnest: A Trivial Comedy for Serious People',
  'Oscar Wilde',
  1895),
 ('An Occurrence at Owl Creek Bridge', 'Ambrose Bierce', 1890),
 ('Also sprach Zarathustra', 'Friedrich Wilhelm Nietzsche', 1896),
 ('Dracula', 'Bram Stoker', 1897)]

# # GitHup Link